//for循环
//打印1~10之间所有整数
//初始值，循环条件，增量
/*
for(var i=1;i<=10;i++){
  console.log(i);
}

//练习：打印80 75 70 65 60
for(var i=80;i>=60;i-=5){
  console.log(i);
}

//练习：计算1~100之间所有奇数的和
var sum=0;//1+3+5...
for(var i=1;i<=100;i++){
  //判断i是否为奇数
  if(i%2===1){
    sum+=i;
  }
}
console.log(sum);

//练习：计算1~20之间所有能被3整除的数字的乘积
var num=1;//3*6*9...
for(var i=1;i<=20;i++){
  //判断i是否能被3整除
  if(i%3===0){
    num*=i;
  }
}
console.log(num);

//闰年：能被4整除，并且不能被100整除，或者能被400整除
//练习：打印2000~2100之间所有的闰年
for(var i=2000;i<=2100;i++){
  //i代表所有的年份
  //判断年份是否为闰年
  if(i%4===0 && i%100!==0 || i%400===0){
    console.log(i);
  }
}
*/
/*
1*1=1
1*2=2 2*2=4
1*3=3 2*3=6 3*3=9
1*5=5 2*5=10   ... 5*5=25
//1*3=3 2*3=6 3*3=9 
var str=''; //''+1+2+3
for(var i=1;i<=3;i++){
  //console.log(i);
  //把每次产生的值 i，拼接到str中
  str+=i+'*3='+(i*3)+' ';
}
console.log(str);
*/
//打印99乘法表第5行
for(var i=1,str='';i<=5;i++){
  //把每次产生的i拼接到一起
  str+=i+'*5='+(i*5)+' ';
}
console.log(str);




